package su;

public class su2 {
    public static void main(String[] args) {
        /*
        • 1. Напишете програма, която чете 3 цели числа от конзолата и отпечатва тяхната сума.

        •Напишете програма, която чете две числа от конзолата и отпечатва по-голямото от тях.
        Опитайте без използване на условния оператор if.•Напишете програма, която чете 5 цели числа,
        въведени от конзолата (всяко число се въвежда на отделен/нов ред), изчислява и отпечатва сумата им.

        •Напишете програма, която чете 3 числа, въведени от конзолата (всяко число се въвежда на отделен/нов ред),
         изчислява и отпечатва сумата на двете от въведените числа с най-големи и най-малки стойности.

         •Напишете програма, която чете 2 реални числа, въведени от конзолата, записва ги в променливи
         от тип double (x и y) и разменя стойностите им, ако x>y. Програмата да отпечатвастойностите xи y.

         •Напишете  програма,  която  намира  най-голямото  от  три,  въведени  от  конзолата, цели числа.
         Използвайте условния оператор if.•Напишете програма, която чете 3 реални числа и ги отпечатва сортирани
         в низходящ  ред. Използвайте  условния  оператор  if.Не  използвайте масиви/метод за сортиране.

         •Напишете програма, която чете цифри(0-9) и извежда въведената от потребителя цифракато дума (на английски).
          Вслучай на невалидно въвеждане програмата да отпечатва „not a digit“.
          Използвайте условната конструкция switch-case.

          •Напишете програма, която намира най-голямото от пет, въведени от  конзолата, цели числа.
          Използвайте условния оператор if.•Напишете програма, която в зависимост от избора на потребителя чете от
          конзолата следните типове данни int, double иString. Ако информацията, въведена  от  потребителя е от
          типове int  или  double,  програмата  я увеличава  с  единица,  а  в  случай  че променливата  есимволенниз,
          програмата  добавя  *  в  края му. Резултатът  се  извежда в  конзолата. Използвайте условната конструкция
           switch-case.•Напишете програма, която чете от конзолата цяло положително число n и
           отпечатва всички числа от 1 до n.•Напишете програма, която чете от конзолата въведени n
           на брой цели числа и връща най-голямото, най-малкото, сумата и средната стойност на всички числа.

           •Напишете програма, която чете въведени от конзолата 10 реални числа, записва ги в масив и извежда
           сумата на елементите му.

         */
    }
}
